Weilv-D/kuafu/stm32_firmware/Core/Src/main.c
#include "stm32f4xx_hal.h"
#include "pin_config.h"
#include "crc8.h"
#include "pi_link.h"
#include "pi_transport.h"
#include "bmi088.h"
#include "ddsm315.h"
#include "st3215.h"
#include "mahony.h"
#include "kinematics.h"
#include "lqr_controller.h"
#include "safety_state.h"
#include "servo_mapping.h"
#include "startup_manager.h"

/* Peripheral Handles */
I2C_HandleTypeDef hi2c1;
UART_HandleTypeDef huart1; /* CH340 Debug/Program */
UART_HandleTypeDef huart2; /* DDSM RS485 */
UART_HandleTypeDef huart3; /* ST3215 Half-Duplex Servo */
UART_HandleTypeDef huart6; /* Pi 5 Bridge */
IWDG_HandleTypeDef hiwdg;
DMA_HandleTypeDef hdma_usart6_rx;

/* Real-Time Telemetry and State variables */
volatile uint32_t g_system_ticks = 0;
BMI088_t g_imu;
MahonyFilter_t g_mahony;
LQRController_t g_lqr;

DDSM_State_t g_ddsm_left;
DDSM_State_t g_ddsm_right;
ST3215_State_t g_servos[4];
static DDSM_Bus_t g_ddsm_bus;
static ST3215_Bus_t g_st3215_bus;

/* Wheel torque commands computed and sent together at each 250 Hz deadline. */
static float g_ctrl_tau_l = 0.0f;
static float g_ctrl_tau_r = 0.0f;
static volatile float g_body_gyro[3] = {0.0f, 0.0f, 0.0f};

/* Max consecutive servo failures before a fatal FAULT lockdown */
#define SERVO_FAIL_LIMIT         3

/* DMA Buffer for Pi Bridge (USART6 RX) */
#define PI_RX_BUF_SIZE           256
uint8_t g_pi_rx_buf[PI_RX_BUF_SIZE];
static PiTransport_t g_pi_transport;
static volatile uint8_t g_pi_poll_requested = 0U;

/* Function Prototypes */
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_DMA_Init(void);
static void MX_IWDG_Init(void);
static void Pi_Command_Snapshot(Pi_Command_Heartbeat_t *hb, Pi_Command_Action_t *act);
void Error_Handler(void);

int main(void) {
    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* Configure the system clock to 168 MHz */
    SystemClock_Config();

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_DMA_Init();
    MX_I2C1_Init();
    MX_USART1_UART_Init();
    MX_USART2_UART_Init();
    MX_USART3_UART_Init();
    MX_USART6_UART_Init();
    MX_IWDG_Init();

    /* Initialize drivers, CRC tables and control states */
    crc8_init();
    pi_link_init();
    pi_transport_init(&g_pi_transport, g_pi_rx_buf, PI_RX_BUF_SIZE);
    safety_state_init();
    lqr_init(&g_lqr);
    mahony_init(&g_mahony, 2.0f, 0.005f); /* Kp = 2.0, Ki = 0.005 */

    g_ddsm_left.id = DDSM_LEFT_ID;
    g_ddsm_right.id = DDSM_RIGHT_ID;
    device_health_init(&g_ddsm_left.health);
    device_health_init(&g_ddsm_right.health);
    ddsm_bus_init(&g_ddsm_bus, &huart2);
    for (int i = 0; i < 4; i++) {
        g_servos[i].id = i + 1; /* IDs: 1, 2, 3, 4 */
        device_health_init(&g_servos[i].health);
        g_servos[i].health.online = 1U; /* optimistic discovery; first valid read timestamps it */
    }
    st3215_bus_init(&g_st3215_bus, &huart3);

    /* Start Pi Link bridge USART6 reception via DMA */
    __HAL_UART_ENABLE_IT(&huart6, UART_IT_IDLE);
    HAL_UART_Receive_DMA(&huart6, g_pi_rx_buf, PI_RX_BUF_SIZE);

    /* Arm gyro data-ready before starting the non-blocking device sequence. */
    HAL_NVIC_SetPriority(IMU_INT_EXTI_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(IMU_INT_EXTI_IRQn);

#if SERVO_ZERO_CALIBRATION_MODE
    /* A calibration image must never leave INIT and start commanding the
     * placeholder center ticks. FAULT keeps wheel commands at zero while the
     * background servo feedback poll remains active. */
    safety_state_trigger_fault(FAULT_SERVO);
#endif

    uint32_t last_tick = 0;
    uint32_t last_left_tick = 0;
    uint32_t last_right_tick = 1;
    uint32_t last_servo_loop_time = 0;
    uint8_t active_servo_query_idx = 0;
    uint32_t last_servo_query_ms = 0U;
    uint8_t fault_servo_disable_idx = 0U;
    uint32_t temp_refresh_counter = 0;
    StartupManager_t startup_manager;
    uint8_t bmi_init_in_progress = 0U;
    uint8_t actuator_discovery_step = 0U;
    uint8_t actuator_configured = 0U;
    uint8_t actuator_enable_step = 0U;
    uint8_t actuators_enabled = 0U;
    uint32_t next_actuator_enable_ms = 0U;
    uint32_t last_pi_poll_ms = 0U;

    startup_manager_init(&startup_manager, HAL_GetTick());

    /* Main background scheduler loop */
    while (1) {
        uint32_t startup_now = HAL_GetTick();
        StartupInputs_t startup_inputs;
        StartupOutputs_t startup_outputs;
        uint8_t startup_servos_online = 1U;

        if (g_pi_poll_requested || startup_now != last_pi_poll_ms) {
            g_pi_poll_requested = 0U;
            last_pi_poll_ms = startup_now;
            (void)pi_transport_poll(&g_pi_transport,
                                    (uint16_t)__HAL_DMA_GET_COUNTER(&hdma_usart6_rx));
        }

        ddsm_bus_step(&g_ddsm_bus, startup_now);
        st3215_bus_step(&g_st3215_bus, startup_now);

        if (bmi_init_in_progress) {
            int bmi_result = bmi088_init_step(&g_imu, startup_now);
            if (bmi_result != 0) {
                bmi_init_in_progress = 0U;
            }
        }

        for (int i = 0; i < 4; ++i) {
            if (!device_health_is_fresh(&g_servos[i].health,
                                        startup_now,
                                        SAFETY_SERVO_MAX_AGE_MS)) {
                startup_servos_online = 0U;
            }
        }
        startup_inputs.now_ms = startup_now;
        startup_inputs.imu_initialized = g_imu.initialized;
        startup_inputs.gyro_calibrated = g_safety_state.is_gyro_calibrated;
        startup_inputs.wheel_l_online = device_health_is_fresh(&g_ddsm_left.health,
                                                               startup_now,
                                                               SAFETY_WHEEL_MAX_AGE_MS);
        startup_inputs.wheel_r_online = device_health_is_fresh(&g_ddsm_right.health,
                                                               startup_now,
                                                               SAFETY_WHEEL_MAX_AGE_MS);
        startup_inputs.servos_online = startup_servos_online;
        startup_inputs.actuator_configured = actuator_configured;
        startup_outputs = startup_manager_step(&startup_manager, &startup_inputs);

        if (startup_outputs.request_imu_init && !g_imu.initialized && !bmi_init_in_progress) {
            bmi088_begin_init(&g_imu, &hi2c1, startup_now);
            bmi_init_in_progress = 1U;
        }

